{"index": {"_index": "recettes", "_id": 1}}
{"type":"Dessert","titre": "crêpe", "difficulty": 1, "person": 4, "ingredient": ["Farine : 250 g ", "Oeuf : 4", " Lait : 25 cl", "sel : 1 pincée", "sucre : 2 c à s", "Beurre fondu : 50 g" ], "making": ["Mettez la farine dans un saladier avec le sel et le sucre.", "Faites un puits au milieu et versez-y les œufs. ","Commencez à mélanger doucement. Quand le mélange devient épais, ajoutez le lait froid petit à petit.","Quand tout le lait est mélangé, la pâte doit être assez fluide. Si elle vous paraît trop épaisse, rajoutez un peu de lait. Ajoutez ensuite le beurre fondu refroidi, mélangez bien.","Faites cuire les crêpes dans une poêle chaude (par précaution légèrement huilée si votre poêle à crêpes n'est pas anti-adhésive). Versez une petite louche de pâte dans la poêle, faites un mouvement de rotation pour répartir la pâte sur toute la surface. Posez sur le feu et quand le tour de la crêpe se colore en roux clair, il est temps de la retourner. ","Laissez cuire environ une minute de ce côté et la crêpe est prête. "]}
{"index": {"_index": "recettes", "_id":2}}
{"type":"Dessert","titre":  "cookies","difficulty": 1, "person": 6, "ingredient": ["Oeuf : 1", "Sucre : 85 g", "Beurre : 85", "Farine : 150 g", "pépites de chocolat : 100 g", "Sucre Vanillé : 1 sachet", "Levure chimique : 1 c à c","sel 1/2 c à c"], "making": ["Laissez ramollir le beurre à température ambiante. Dans un saladier, malaxez-le avec le sucre.", "Ajoutez l'oeuf et éventuellement le sucre vanillé.", "Versez progressivement la farine, la levure chimique, le sel et les pépites de chocolat. Mélangez bien.","Beurrez une plaque allant au four ou recouvrez-la d'une plaque de silicone. À l'aide de deux cuillères à soupe ou simplement avec les mains, formez des noix de pâte en les espaçant car elles s'étaleront à la cuisson.", "Faites cuire 8 à 10 minutes à 180°C soit thermostat 6. Il faut les sortir dès que les contours commencent à brunir. "]}
{"index": {"_index": "recettes", "_id":3}}
{"type":"Plat","titre": "Tartiflette", "difficulty": 1, "person": 4, "ingredient": ["Reblochon : 1","Pomme de terre : 1 kg","Oignon : 500 g", "Lardon : 200 g", "Vin blanc : 15 cl","Beurre : une noix", "Poivre"], "making": ["Dans une grande casserole d'eau bouillante salée, faites cuire les pommes de terre préalablement épluchées. Égouttez-les et réservez-les une fois qu'elles sont bien cuites, c'est-à-dire lorsque l'on peut y enfoncer une lame de couteau sans qu'elles ne se cassent pour autant (comptez environ 15 minutes de cuisson).", "Pendant que cuisent les pommes de terre, faites fondre une noix de beurre dans une poêle et faites-y revenir les oignons détaillés d'abord vivement pendant quelques minutes puis à feu doux. Lorsqu'ils sont translucides, versez le vin blanc, et laissez cuire jusqu'à ce que l'alcool soit évaporé et les oignons imbibés. Réservez.","Répartissez la moitié des oignons confits dans le fond d'un plat allant au four, ainsi que les lardons revenus à la poêle, puis épongés de leur excédent de gras. Disposez les pommes de terre découpées en rondelles dessus, puis répartissez le reste d'oignons et de lardons.","Choisissez un reblochon au lait cru de couleur jaune-orangée. Grattez la croûte au couteau pour la nettoyer, puis coupez le fromage en deux. Coupez chaque moitié horizontalement et déposez les quatre morceaux sur les oignons, croûte vers le haut. Poivrez légèrement mais ne salez pas. Faites cuire environ 30 minutes à 180°c jusqu'à ce que la tartiflette soit bien dorée, le fromage parfaitement fondu. En fin de cuisson, n'hésitez pas à mettre le four en position grill pour dorer la tartiflette."]}
{"index": {"_index": "recettes", "_id":4}}
{"type":"Dessert","titre": "Pancakes", "difficulty": 1, "person": 4, "ingredient": ["Farine : 250 g","Sucre : 75 g","Beurre : 50 g","Oeufs : 2","Lait entier : 40 cl","Levure chimique : 3 c à s","Sucre vanillé : 1 sachet", "sel : 1 pincée"], "making": ["1. Tamisez la farine et la levure dans un saladier. Ajoutez le sucre, le sucre vanillé et le sel.","Creusez un puits, ajoutez les oeufs, le beurre fondu et un peu de lait puis travaillez la pâte.","Mouillez progressivement avec le reste du lait jusqu'à ce que la pâte forme un ruban.", "Faites cuire les pancakes dans une petite poêle beurrée bien chaude. Versez une demi-louche de préparation et faites cuire 2 à 3 minutes le temps que des bulles se forment à la surface. Retournez et faites cuire 2 minutes sur l'autre face. "]}
{"index": {"_index": "recettes", "_id":5}}
{"type":"Dessert","titre": "Tiramisu", "difficulty": 1, "person": 4, "ingredient": ["Mascarpone : 250 g", "Oeuf : 3", "Sucre : 100", "café fort : 20 cl", "Amareto : 2 c à s", "Biscuits cuillère : 20", "Poudre de cacao"], "making": ["Fouettez vivement 3 jaunes d'œufs avec le sucre glace jusqu'à ce que le mélange blanchisse et devienne mousseux. Ajoutez ensuite le mascarpone puis mélangez jusqu'à ce que le résultat soit bien homogène.", "2. Montez 3 blancs en neige ferme en y ajoutant une pincée de sel, puis mélangez-les à la crème au mascarpone. Attention, pour garder un mélange bien mousseux et léger, les blancs ne doivent pas être \"cassés\". Mélangez délicatement de haut en bas avec une spatule en silicone en tournant votre récipient d'un quart de tour à chaque fois.","Préparez une grande tasse de café fort, de préférence un expresso. Ajoutez-y l'Amaretto, un alcool italien à l'amande qui parfumera incroyablement votre dessert, puis mélangez.","Coupez le bout des biscuits afin qu'ils adhèrent parfaitement à la paroi de votre plat. Utilisez les bouts pour compléter les trous au centre de votre tiramisu. Étalez une couche de crème au mascarpone au fond du plat, puis placez une couche de biscuits légèrement imbibés de café à l'Amaretto.","Répétez l'opération en terminant par une couche de crème au mascarpone que vous saupoudrez de poudre de cacao amer ou de copeaux de chocolat. Placez au frais pour au moins 3 heures."]}
{"index": {"_index": "recettes", "_id":6}}
{"type":"","titre": "", "difficulty": 0, "person": 0, "ingredient": [""], "making": [""]}
{"index": {"_index": "recettes", "_id":7}}
{"type":"","titre": "", "difficulty": 0, "person": 0, "ingredient": [""], "making": [""]}
{"index": {"_index": "recettes", "_id":8}}
{"type":"","titre": "", "difficulty": 0, "person": 0, "ingredient": [""], "making": [""]}
{"index": {"_index": "recettes", "_id":9}}
{"type":"","titre": "", "difficulty": 0, "person": 0, "ingredient": [""], "making": [""]}
{"index": {"_index": "recettes", "_id":10}}
{"type":"","titre": "", "difficulty": 0, "person": 0, "ingredient": [""], "making": [""]}